In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [3]:
#create series

data = Series(['one', 'two', np.nan, 'four'])

data

0     one
1     two
2     NaN
3    four
dtype: object

In [5]:
#find missing values

data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
#remove null values

data.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
#create data frame with null valiues

dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan, 9],[np.nan,np.nan,np.nan]])

dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [9]:
#drop null values from the data frame

clean_dframe = dframe.dropna()
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [10]:
#if drop NA, pandas will drop row even if one value is missing

In [11]:
# remove only misign values
dframe.dropna(how='all')

#how all will drop rows where all the data was null value (row 4)

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [13]:
#specify to frop columns with null

dframe.dropna(axis=1)
#drops all values as all columsn had null value

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [14]:
#treshold a missing value

#remove data points missing tree data points
npn = np.nan

dframe2 = DataFrame([[1,2,3, npn], [2,npn,5,6], [npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [16]:
#treshold by ponts which dont have a null

#show rows whoch have at least two data points
#last row going to be dropped

dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [17]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [18]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [23]:
#fill null values with value 1

dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [24]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [25]:
#fill in values for different columns

#pass a dictionary

dframe2.fillna({0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [27]:
#make a change permanent

dframe2.fillna(0, inplace=True)

In [28]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0